In [2]:
import pandas as pd
import numpy as py

In [ ]:
zone_1 = ['05EZ1', '05EZ2', '05FZ1', '05FZ2', '06AZ1', '06ZA2', '06BZ2', '06EZ1', '06EZ2', '06FZ1', '06FZ2', 
'05GN1', '05GN2', '05HN1', ]

In [6]:
file_path = 'data/'

In [5]:
table_list = pd.read_csv('data/arcgis_num.csv')
table_list = table_list.drop('Unnamed: 1', axis='columns')
table_list = table_list.dropna()
table_list = table_list.reset_index(drop=True)


table_list

     Unnamed: 0
0             1
1             2
2             3
3             4
4             5
...         ...
1005       1006
1006       1007
1007       1008
1008       1009
1009       1010

[1010 rows x 1 columns]

In [8]:
table_list_ = pd.read_csv('data/arcgis_names.csv')
table_list_ = table_list_.drop('Unnamed: 1', axis='columns')
table_list_ = table_list_.dropna()
table_list_ = table_list_.reset_index(drop=True)


table_list_

    Unnamed: 0
0         Name
1        01GN1
2        01GN2
3        01GZ1
4        01GZ2
..         ...
975      69FN1
976      69FZ1
977      69GN1
978      69GN2
979      69HN1

[980 rows x 1 columns]

In [23]:
table_list = pd.read_csv('data/arcgis_names.csv')

In [26]:
table_list = table_list.drop('Unnamed: 1', axis='columns')

In [28]:
table_list = table_list.dropna()
table_list = table_list.reset_index(drop=True)
table_list

    Unnamed: 0
0         Name
1        01GN1
2        01GN2
3        01GZ1
4        01GZ2
..         ...
975      69FN1
976      69FZ1
977      69GN1
978      69GN2
979      69HN1

[980 rows x 1 columns]

In [14]:
table_list = table_list.drop('Unnamed: 1', axis='columns')

In [15]:
table_list = table_list.drop([0,1,2,3,4])

In [17]:
table_list = table_list.dropna()

In [21]:
table_list.reset_index(drop=True)

                                                   Name
0                                                 01CZ1
1     https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/02a_...
2     https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/02b_...
3     https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/03a_...
4     https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/03b_...
...                                                 ...
4890                                              69HN1
4891  https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/02a_...
4892  https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/02b_...
4893  https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/03a_...
4894  https://ns_hwh.fundaments.nl/hwh-ahn/ahn4/03b_...

[4895 rows x 1 columns]

979.0

In [9]:
data = {'Name': [],
'AHN4_DTM_05m': [],
'AHN4_DTM_5m': [],
'AHN4_DSM_05m': [],
'AHN4_DSM_5m': []}

df = pd.DataFrame(data)
df

Empty DataFrame
Columns: [Name, AHN4_DTM_05m, AHN4_DTM_5m, AHN4_DSM_05m, AHN4_DSM_5m]
Index: []